# Pandas - DataFrame

In [1]:
import numpy as np
import pandas as pd

In [4]:
emps = {"Name": ["Jill", "Bob", "Mary", "Sue", "Jim"],
        "Age": [28, 34, 29, 42, 23],
        "Salary": [70000, 80000, 65000, 90000, 60000],
        "Department": ["HR", "IT", "Finance", "IT", "HR"],
        "City": ["New York", "San Francisco", "Chicago", "San Francisco", "New York"]}

In [6]:
pd.DataFrame(emps)

   Name  Age  Salary Department           City
0  Jill   28   70000         HR       New York
1   Bob   34   80000         IT  San Francisco
2  Mary   29   65000    Finance        Chicago
3   Sue   42   90000         IT  San Francisco
4   Jim   23   60000         HR       New York

In [7]:
pd.read_csv("data/movies.csv")

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

In [10]:
pd.read_csv("data/movies.csv").dtypes

Rank       int64
Title     object
Studio    object
Gross     object
Year       int64
dtype: object

In [11]:
pd.read_csv("data/movies.csv", index_col="Title")

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

In [13]:
movies = pd.read_csv("data/movies.csv", index_col="Title")
movies

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

In [14]:
movies.head(10)

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018
Jurassic World                   6    Universal  $1,671.70   2015
Marvel's The Avengers            7  Buena Vista  $1,518.80   2012
Furious 7                        8    Universal  $1,516.00   2015
Avengers: Age of Ultron          9  Buena Vista  $1,405.40   2015
Black Panther                   10  Buena Vista  $1,346.90   2018

In [15]:
movies.tail(3)

                          Rank           Studio     Gross  Year
Title
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [16]:
movies.iloc[0]      # First row

Rank                1
Studio    Buena Vista
Gross      $2,796.30
Year             2019
Name: Avengers: Endgame, dtype: object

In [17]:
movies.iloc[5]  # Sixth row

Rank               6
Studio     Universal
Gross     $1,671.70
Year            2015
Name: Jurassic World, dtype: object

In [18]:
movies.loc["Valkyrie"]  # Row with index label "Valkyrie"

Rank           782
Studio         MGM
Gross     $200.30
Year          2008
Name: Valkyrie, dtype: object

In [19]:
movies.iloc[1:4]  # Rows 1 to 3

                              Rank       Studio       Gross  Year
Title
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

In [20]:
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

In [21]:
type(movies)

pandas.core.frame.DataFrame

In [25]:
type(movies["Studio"])

pandas.core.series.Series

In [26]:
movies["Studio"]        # movies.Studio

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

In [29]:
type(movies[["Gross"]])

pandas.core.frame.DataFrame

In [30]:
movies.Gross.dtype

dtype('O')

In [32]:
movies.Gross.head(3)

Title
Avengers: Endgame    $2,796.30
Avatar               $2,789.70
Titanic              $2,187.50
Name: Gross, dtype: object

In [37]:
movies["Gross"].str.replace("$", "").str.replace(",", "").astype(float)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

In [38]:
movies["Gross"].head(3)

Title
Avengers: Endgame    $2,796.30
Avatar               $2,789.70
Titanic              $2,187.50
Name: Gross, dtype: object

In [40]:
movies["Gross"] = (
    movies["Gross"]
    .str.replace("$", "")
    .str.replace(",", "")
    .astype(float)
)

In [41]:
movies["Gross"]

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

In [44]:
nba = pd.read_csv("data/nba.csv", parse_dates=["Birthday"])
nba.head()

C:\Users\singa\AppData\Local\Temp\ipykernel_2132\2434590364.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba = pd.read_csv("data/nba.csv", parse_dates=["Birthday"])

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [45]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [46]:
movies.head()

                              Rank       Studio   Gross  Year
Title
Avengers: Endgame                1  Buena Vista  2796.3  2019
Avatar                           2          Fox  2789.7  2009
Titanic                          3    Paramount  2187.5  1997
Star Wars: The Force Awakens     4  Buena Vista  2068.2  2015
Avengers: Infinity War           5  Buena Vista  2048.4  2018

In [48]:
movies.sort_values(by=["Studio", "Year"])

                         Rank       Studio  Gross  Year
Title
The Blair Witch Project   588      Artisan  248.6  1999
101 Dalmatians            708  Buena Vista  215.9  1961
The Jungle Book           755  Buena Vista  205.8  1967
Who Framed Roger Rabbit   410  Buena Vista  329.8  1988
Dead Poets Society        636  Buena Vista  235.9  1989
...                       ...          ...    ...   ...
The King's Speech         276    Weinstein  414.2  2010
The Intouchables          265    Weinstein  426.6  2012
Django Unchained          266    Weinstein  425.4  2012
Silver Linings Playbook   631    Weinstein  236.4  2012
The Imitation Game        642    Weinstein  233.6  2014

[782 rows x 4 columns]

In [49]:
movies.sort_values(by=["Studio", "Year"], ascending=False)

                         Rank       Studio  Gross  Year
Title
The Imitation Game        642    Weinstein  233.6  2014
The Intouchables          265    Weinstein  426.6  2012
Django Unchained          266    Weinstein  425.4  2012
Silver Linings Playbook   631    Weinstein  236.4  2012
The King's Speech         276    Weinstein  414.2  2010
...                       ...          ...    ...   ...
The Little Mermaid        738  Buena Vista  211.3  1989
Who Framed Roger Rabbit   410  Buena Vista  329.8  1988
The Jungle Book           755  Buena Vista  205.8  1967
101 Dalmatians            708  Buena Vista  215.9  1961
The Blair Witch Project   588      Artisan  248.6  1999

[782 rows x 4 columns]

In [51]:
movies.sort_values(by=["Studio", "Year"], ascending=[False, True])

                         Rank       Studio   Gross  Year
Title
Inglourious Basterds      424    Weinstein   321.5  2009
The King's Speech         276    Weinstein   414.2  2010
The Intouchables          265    Weinstein   426.6  2012
Django Unchained          266    Weinstein   425.4  2012
Silver Linings Playbook   631    Weinstein   236.4  2012
...                       ...          ...     ...   ...
Captain Marvel             22  Buena Vista  1128.3  2019
Aladdin                    59  Buena Vista   880.2  2019
Toy Story 4               198  Buena Vista   519.8  2019
Dumbo                     369  Buena Vista   351.8  2019
The Blair Witch Project   588      Artisan   248.6  1999

[782 rows x 4 columns]

In [53]:
movies["Studio"].value_counts()

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
MGM                        11
TriStar                    11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Polygram                    2
Orion                       2
SonR                        2
Dimension                   2
Vestron                     1
USA                         1
Lions                       1
Focus                       1
Rela.                       1
CL                          1
Pathe                       1
Artisan                     1
IFC                         1
GrtIndia                    1
RKO                         1
UTV                         1
FUN                         1
FR                          1
Newmarket                   1
China Film Corporation      1
HC                          1
Magn.                       1
Name: count, dtype: int64